chat_system_1314121354_actor_description=King Mark. Our king.
chat_system_1314121354_snap_0_question=^?^My faithful searcher, I do so hope you've brought us news that Baron Ahey has received just punishment for the crimes he has committed?
chat_system_1314121354_snap_0_answer_0=^?^The traitor is killed, and so justice is rendered, Your Majesty! And I managed to find out that shortly before the attack, the baron found a very rich gold deposit in the mines...
chat_system_1314121354_snap_0_answer_1=^?^I wish to know how I can find Baron Ahey's castle.
chat_system_1314121354_snap_2_question=^?^Well, this explains everything! Having got hold of the Creiston Mines he certainly started to explore this gold deposit without informing the exchequer, and therefore robbed the treasury of taxes rightfully due...<br>In his greed, he turned innocent dwarves into slaves, led Darion to war on false pretenses, and stole from his own kingdom. But in the end he brought himself to his grave! Thank you, [player], for righting this terrible wrong!<br>[reward]
chat_system_1314121354_snap_2_answer_0=^?^I'm happy to serve Your Majesty!
chat_system_1314121354_snap_1_question=^?^Go to the east to Arlania province, there you shall travel toward the mountains, straight along the road. The entrance to the Creiston Mines is watched by royal guards. Order the guards' chief to lift the siege of the mines. Ahey's castle is there, underground, near the waterfall. You will see that it is easy to find.
chat_system_1314121354_snap_1_answer_0=^?^Thank you for the explanation.
